Revit 2024 API
FileImportedEventArgs.Format Property
 Identifies the import format, e.g. DWG or image.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public ImportExportFileFormat Format { get; }
Visual Basic
Public ReadOnly Property Format As ImportExportFileFormat
	Get
Visual C++
public:
property ImportExportFileFormat Format {
	ImportExportFileFormat get ();
}
See Also
FileImportedEventArgs Class
Autodesk.Revit.DB.Events Namespace